app/Http/Controllers/CustomersController.php

select * from `customers` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `customers`
---
    public function index(): View
    {
        return view('customers.index', [
            'customers' => Customers::orderBy('id', 'DESC')->paginate(env('APP_PAGE_FULL'))
        ]);

select * from `machines` where `machines`.`customer` = 1 and `machines`.`customer` is not null limit 5 offset 0
select count(*) as aggregate from `machines` where `machines`.`customer` = 1 and `machines`.`customer` is not null
---
    public function show(Customers $customer): View
    {
        $machines = $customer->getMachines()->paginate(env('APP_PAGE_HALF'));