app/Http/Controllers/JobsController.php

select * from `machines` where `machines`.`id` = '1' limit 1
---
    public function create(Request $request): View
    {
        return view('jobs.create', [
            'engineers' => Engineers::all(),
            'machine'   => Machines::find($request->id),

insert into `job_histories` (`field`, `old`, `new`, `user`, `record`, `updated_at`, `created_at`) values ('all', 'N/A', 'Job Created', 2, 2, '2024-02-28 21:57:35', '2024-02-28 21:57:35')
---
    public function store(StoreJobsRequest $request): RedirectResponse
    {
        $job = Jobs::create($request->all());
        JobHistory::create(['field' => 'all', 'old' => 'N/A', 'new' => 'Job Created', 'user' => auth()->user()->id, 'record' => $job->id]);