app/Http/Controllers/MachinesController.php

    public function index(): View
    {
        return view('machines.index', [
            'machines'  => Machines::latest()->paginate(env('APP_PAGE_FULL')),
        ]);
---
select * from `machines` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `machines`

    public function create(Request $request): View
    {
        return view('machines.create', [
            'customers'     => Customers::all(),
            'customerId'    => $request->id,
        ]);
---
select * from `customers`

    public function store(StoreMachinesRequest $request): RedirectResponse
    {
        Machines::create($request->all());
---
insert into `machines` (`customer`, `stock`, `asset`, `serial`, `make`, `model`, `yom`, `updated_at`, `created_at`) values ('1', '804/0014', '', 'lwjaz140an07300014', 'LGMG', 'AR14J', '2022', '2024-02-28 21:56:19', '2024-02-28 21:56:19')