app/Http/Controllers/RoleController.php

select * from `roles` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `roles`
---
    public function index(): View
    {
        return view('roles.index', [
            'roles' => Role::orderBy('id', 'DESC')->paginate(env('APP_PAGE_FULL'))
        ]);

select `permission_id` from `role_has_permissions` where `role_id` = 2
select * from `permissions`
---
    public function edit(Role $role): View
    {
        if($role->name == 'Super Admin') {
            abort(403, 'SUPER ADMIN ROLE CANNOT BE EDITED');
        }

        $rolePermissions = DB::table("role_has_permissions")->where("role_id", $role->id)
            ->pluck('permission_id')
            ->all();

        return view('roles.edit', [
            'role'              => $role,
            'permissions'        => Permission::get(),