app/Http/Controllers/StatusController.php

    public function index(): View
    {
        return view('status.index', [
            'status' => Status::latest()->paginate(env('APP_PAGE_FULL'))
        ]);
---
select count(*) as aggregate from `statuses`